validation/performance/k6_load_summary_fresh.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  01.0s/10s

running (02.0s), 50/50 VUs, 7 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  02.0s/10s

running (03.0s), 50/50 VUs, 14 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  03.0s/10s

running (04.0s), 50/50 VUs, 17 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  04.0s/10s

running (05.0s), 50/50 VUs, 17 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  05.0s/10s
time="2026-08-02T12:13:01+02:00" level=warning msg="Request Failed" error="request timeout"
time="2026-08-02T12:13:01+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"
time="2026-08-02T12:13:01+02:00" level=warning msg="Request Failed" error="request timeout"
time="2026-08-02T12:13:01+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"
time="2026-08-02T12:13:02+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"
time="2026-08-02T12:13:02+02:00" level=warning msg="Request Failed" error="request timeout"
time="2026-08-02T12:13:02+02:00" level=warning msg="Request Failed" error="request timeout"
time="2026-08-02T12:13:02+02:00" level=warning msg="Request Failed" error="request timeout"
[...]

running (06.0s), 50/50 VUs, 32 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  06.0s/10s
time="2026-08-02T12:13:03+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"

running (07.0s), 50/50 VUs, 44 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  07.0s/10s

running (08.0s), 50/50 VUs, 246 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  08.0s/10s

running (09.0s), 50/50 VUs, 480 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  09.0s/10s

running (10.0s), 50/50 VUs, 668 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  10.0s/10s

running (11.0s), 50/50 VUs, 668 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s

running (12.0s), 50/50 VUs, 668 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s

running (13.0s), 50/50 VUs, 668 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s

running (14.0s), 50/50 VUs, 668 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="request timeout"
time="2026-08-02T12:13:11+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/health\": request timeout"

running (15.0s), 42/50 VUs, 676 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s
time="2026-08-02T12:13:12+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"

running (16.0s), 02/50 VUs, 716 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s
time="2026-08-02T12:13:13+02:00" level=warning msg="Request Failed" error="Get \"http://172.18.0.4:30081/\": dial tcp 172.18.0.4:30081: connect: connection refused"

running (17.0s), 01/50 VUs, 717 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s

     ✗ health 200
      ↳  16% — ✓ 119 / ✗ 599
     ✓ home reachable

     checks.........................: 58.28% 837 out of 1436
     data_received..................: 1.4 MB 79 kB/s
     data_sent......................: 121 kB 7.1 kB/s
     errors.........................: 83.42% 599 out of 718
     http_req_blocked...............: avg=39.39µs   min=0s       med=3.7µs    max=6.27ms      p(90)=7.1µs       p(95)=27.67µs    
     http_req_connecting............: avg=24.69µs   min=0s       med=0s       max=3.18ms      p(90)=0s          p(95)=0s         
   ✗ http_req_duration..............: avg=444.03ms  min=0s       med=2.5ms    max=5s          p(90)=1.87s       p(95)=4.11s      
       { expected_response:true }...: avg=2.42s     min=6.05ms   med=2.58s    max=4.93s       p(90)=4.62s       p(95)=4.88s      
   ✗ http_req_failed................: 91.71% 1317 out of 1436
     http_req_receiving.............: avg=65.27ms   min=0s       med=38.13µs  max=3.5s        p(90)=153.88µs    p(95)=81.85ms    
     http_req_sending...............: avg=43.89µs   min=0s       med=9.69µs   max=4.7ms       p(90)=24.25µs     p(95)=51.75µs    
     http_req_tls_handshaking.......: avg=0s        min=0s       med=0s       max=0s          p(90)=0s          p(95)=0s         
     http_req_waiting...............: avg=378.71ms  min=0s       med=2.45ms   max=5s          p(90)=1.49s       p(95)=3.12s      
     http_reqs......................: 1436   84.211632/s
     iteration_duration.............: avg=1.09s     min=201.46ms med=205.95ms max=7.32s       p(90)=5.58s       p(95)=6.14s      
     iterations.....................: 718    42.105816/s
     response_time..................: avg=444.03533 min=0        med=2.506768 max=5002.790377 p(90)=1870.513145 p(95)=4116.483591
     vus............................: 1      min=1            max=50
     vus_max........................: 50     min=50           max=50


running (17.1s), 00/50 VUs, 718 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s
time="2026-08-02T12:13:14+02:00" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"